
export default {
    OilColors: {
        idx:"0",
        "tit": "Oil Colors",
        "video":"https://www.shinhanart.com/video/Product/Oil Colors/OC_MAIN_KR_EN.mp4",
        "stit": "컬러 제조 기술의 정점, 신한 전문가 유화",
        "stxt":"전문가 등급의 유화 개발 가능 여부에 따라 기술의 척도를 예상할 수 있습니다. 안료와 기름의 최적 혼합비부터 이상적인 물성을 위한 원 재료의 제조, 상품화를 위한 숙성 단계까지 유화는 정밀한 공정과 더불어 축적된 노하우와 정성이 필요합니다. 마치 대량 공산품이 아닌 아름다운 예술품을 빚어내는 과정과 같습니다. 신한화구는 1970년대부터 전문가 유화 개발을 시작해 1978년 국내 최초로 전문가 등급의 유화를 발표했고 높은 컬러 품질을 제공함에 따라 현재까지 아티스트들의 선택을 받고 있습니다. 전문가 유화의 독자적인 개발과 제조, 대량 생산은 전문가 미술재료 제조기업으로서 기술의 정점에 있다는 것을 증명하는 것과 다름이 없습니다. 높은 기술적 우위를 바탕으로 현재 전문 아티스트들을 위한 신한 전문가 유화와 남들과는 다른 라이프 스타일을 추구하는 하비스트들을 위한 sh 유화 2개의 제품 라인업을 선보이고 있습니다. 신한화구의 정체성을 나타내는 특별한 사각 로고가 표기된 제품은 전문가 등급의 최고급 품질을 인증하는 신한화구만의 기술적 보증을 상징합니다.",
        "option":{
            opt_tit:[
                "신한 전문가 유화",
                "sh 유화",
            ],
            opt_txt:[
                [
                    "선별된 안료와 전용 기름을 사용한 총 109색",
                    "코발트와 카드뮴 안료로 개선된 작품 보존성",
                    "인공 태양 측정기로 검증된 정확한 내광성",
                    "다양한 환경의 내습성 테스트로 편차 없는 컬러 품질",
                ],
                [
                    "특별한 라이프 스타일을 즐기는 하비스트를 위한 총 60색",
                    "나이프 기법과 붓 사용에 적합한 부드러운 크림 같은 제형",
                    "전문가 등급의 기술이 접목된 높은 컬러 품질",
                ]
            ],
            
        },
    },
    KoreanColors: {
        idx:"1",
        "tit": "Korean Colors",
        "video":"https://www.shinhanart.com/video/Product/Korean Color/SH_제품페이지_한국화 롤링_KR EN 공통.mp4",
        "stit": "대한민국 전통 회화의 정신과 맥을 잇는 신한 전문가 한국화",
        "stxt":"신한화구의 한국화 물감 개발은 천연에서 추출된 아교를 분채와 혼합해 사용했던 이전의 불편함을 해소하고 재료의 간편함과 편리함을 제공해 대한민국 전통 회화의 명맥이 지속될 수 있도록 하자라는 다짐에서 출발했습니다. 1977년 대량 생산이 가능한 아교를 연구해 튜브 용기에 담아내는데 성공했습니다. 복잡한 절차 없이 일반적인 물감과 같이 편리하게 사용할 수 있는 패러다임의 변화를 가져왔습니다. 신한 전문가 한국화의 총 50가지의 색상은 대한민국의 전통 종이인 한지 표면에서 동양적인 특유의 컬러 감성이 표현될 수 있도록 조율 되었습니다. 작품을 완성하는 아티스트와 쓰이는 재료의 이상적인 조화라는 기업 철학을 바탕으로 개발된 신한 전문가 한국화는 전통 회화의 정신과 맥을 잇는 첨병과도 같은 존재임을 자신 있게 말씀드립니다. 현재 전통 회화 작가를 위한 신한 전문가 한국화와 남다른 라이프 스타일을 즐기는 하비스트를 위한 sh 한국화를 제품 라인업으로 선보이고 있습니다. 신한화구의 정체성을 나타내는 특별한 사각 로고가 표기된 제품은 전문가 등급의 최고급 품질을 인증하는 신한화구만의 기술적 보증을 상징합니다.",
        "option":{
            opt_tit:[
                "신한 전문가 한국화",
                "sh 한국화",
            ],
            opt_txt:[
                [
                    "선별된 고품질의 안료로 특유의 한국 정서를 담은 총 50색",
                    "엄선된 아교액 사용으로 전통 종이 한지 표면에 최적화",
                    "컬러 별 아교액 혼합 및 배합 비율 최적화로 강한 접착력 형성",
                    "작품의 장기보존을 위한 변색, 퇴색이 적은 높은 내광성",
                ],
                [
                    "하비스트의 실력 향상과 기본 페인팅을 위한 한국화채색",
                    "전문가 등급의 고유 제조기술이 접목되어 높은 컬러 품질",
                    "농담 조절이 유연하고 한지 채색에 이상적인 총 13색",
                ]
            ],
            
        },
    }
};