// 서브페이지 맨 위 데이터

export default {
    OilColors_shinhan: {
        idx:"1",
        tit: "신한 전문가 유화",
        txt:"신한 전문가 유화는 숙련된 개발자에 의해 컬러를 빚어내며 데이터 기반의 과학적인 방법으로 다양한 테스트를 진행해 완벽한 품질을 증명합니다. 아티스트의 입장에서 생각하고 고민하며 본질에 충실한 총 109가지 컬러를 경험하세요.",
    },
    OilColors_SH: {
        idx:"2",
        tit: "시선까지 사로잡는 sh 유화",
        txt:"미술은 더 이상 전문 작가의 영역이 아닙니다. 하비스트들의 작품과 라이프스타일을 한 단계 업 시켜줄 트렌디하고 스타일리시한 sh 유화의 총 60가지 컬러를 사용해 보세요. 높은 컬러 품질과 발색으로 전문가 이상의 작품을 그려내고 그 가치를 빛낼 수 있습니다.",
    },
    KoreanColors_shinhan: {
        idx:"3",
        tit: "전통 회화의 아름다움을 채우다",
        txt:"신한 전문가 한국화는 전통 회화를 위한 총 50가지의 색상으로 한국화 작가들이 더 간편하고 편리하게 사용할 수 있도록 튜브 형태로 제조된 제품입니다. 세심하게 조율된 아교를 바탕으로 맑고 엷으며, 부드럽게 채색되는 특유의 감성을 담아 내었습니다.",         
        },
    KoreanColors_SH: {
        idx:"4",
        tit: "비기너를 위한 sh 한국화",
        txt:"sh 한국화는 신한화구의 준전문가 브랜드인 sh의 라인업으로 높은 제조 기술을 기반으로 합니다. 한국화 특유의 감성을 그대로 구현하며 고급 품질을 갖추고 있어 모두에서 합리적인 제품입니다.",         
        },
    };