// 서브페이지 특징 데이터

//1. 오일컬러
// 1-1. 신한 전문가유화
const oilShinhan = [
    {
        idx:"1",
        subTit:"신한 전문가 유화",
        subTxt:"아티스트들의 완성된 작품을 보는 순간 느끼는 감동과 전율이 오랜 시간이 지난 후에도 변함없는 컬러로 전달되어야 한다는 고민은 1978년 국내 최초 신한 전문가 유화 개발에 있어 많은 것을 반영하게 했습니다. 작품을 완성하는 예술가와 그것을 표현하는 컬러의 조화는 가장 중요한 본질이기에 숙련된 개발자에 의해서 컬러를 빚어내며 과학적인 접근으로 다양한 테스트를 진행해 완벽한 품질을 증명합니다. 아티스트의 입장에서 생각하고 고민하며 기본과 본질에 충실한 신한 전문가 유화의 총 109가지 색상을 경험해 보세요.",
    },
    {
        idx:"2",
        subTit:"순수 안료와 정제된 기름",
        subTxt:"신한 전문가 유화는 중후하고 풍부한 컬러 감성을 전달하기 위해 전 세계를 원산지로 하는 고품질의 안료를 사용합니다. 신한화구 색채 연구소의 높은 기준과 검증으로 선별하고 세밀하게 정제된 전용 기름을 각 색상 별로 조율하며 최적화합니다. 과학적으로 축적된 정밀한 기술 데이터와 50년 이상의 제조 노하우로 생산되기에 항상 안정된 컬러 체질을 제공하고 있습니다."
    },
    {
        idx:"3",
        subTit:"작품의 보존성을 위한 코발트와 카드뮴 무기안료 사용",
        subTxt:"코발트와 카드뮴 안료는 화학 연구 분야의 최대 성과로 내광성이 좋고 퇴색이 잘되지 않는 카드뮴, 코발트 무기안료는 물감에서 매우 중요한 안료입니다. 내광성이 좋은 무기안료를 사용해 만든 컬러는 장기적인 유화 작품 보존에 매우 이상적입니다. 물감 튜브 패키지에는 스탠다드 페이드 오 미터기(Standard Fade O Meter)를 사용한 자외선 퇴색 실험 결과(내광성 표기)와 혼색 주의 표기가 되어있어 사용자가 작품의 목적에 맞게 구분하여 사용할 수 있습니다.",
    },
    {
        idx:"4",
        subTit:"믹싱과 팔레트 사용을 위한 일관된 제형",
        subTxt:"신한 전문가 유화는 전 세계의 다양한 기후와 가혹한 작업 환경에서도 사용될 수 있도록 균형 잡힌 점도와 제형으로 조율되었습니다. 최초 제품 개봉 이후 오랜 시간이 지나도 변형되지 않습니다. 아티스트에게 기분 좋은 사용감을 편차 없이 전달하며 정교한 혼색이 가능하므로 다양한 환경에서 문제없이 페인팅 작업을 진행할 수 있습니다.",
    },
    {
        idx:"5",
        subTit:"조광, 내습, 내열성 테스트를 통한 신뢰성",
        subTxt:"신한화구 컬러 시험팀은 150년이라는 시간을 상정해 테스트를 진행합니다. 실제 캔버스 위에 칠해진 총 109가지 컬러는 인공 태양 설비인 스탠다드 페이드 오 미터기(Standard Fade O Meter)를 통해 수백 년간 받을 수 있는 자외선의 양을 환산해 집중 조명하는 시험을 통해 변색 및 이상 여부를 측정합니다. 또한 자외선 발생에 따른 습도 범위 70%, 내열 섭씨온도 60 °C 까지 가혹한 환경을 넓은 범위로 구현하고 컬러를 노출시켜 변화 값을 측정해 신뢰할 수 있는 내광성에 대한 기준을 표기합니다.",
    },
  ];

  // 1-2. SH 유화
const oilSH = [
    {
        idx:"1",
        subTit:"쉿! 나만 알고 싶은 sh 유화",
        subTxt:"sh 유화는 고품질 안료와 전문가 등급의 정제 기름을 그대로 사용해 풍부한 컬러 감성과 선명한 발색을 표현합니다. 다양한 회화 장르에 대응하고 유연하고 창조적인 혼색을 위한 총 60가지 색상을 제공합니다.",
    },
    {
        idx:"2",
        subTit:"고급 안료와 총 60가지 색상",
        subTxt:"sh 유화는 고품질 안료와 전문가 등급의 정제 기름을 그대로 사용해 풍부한 컬러 감성과 선명한 발색을 표현합니다. 다양한 회화 장르에 대응하고 유연하고 창조적인 혼색을 위한 총 60가지 색상을 제공합니다.",
    },
    {
        idx:"3",
        subTit:"부드러운 제형으로 쉬운 기법 구현",
        subTxt:"하비스트들이 쉽게 접근하고 작업을 진행할 수 있도록 균형적인 물성과 제형으로 조율되었습니다. 유화 장르의 전용 도구인 나이프를 활용한 채색과 혼색을 쉽게 진행할 수 있으며 브러시 사용에도 이상적입니다. 늘 일정한 점도를 유지하기에 임파스토와 같은 기법 구현 연습에 탁월합니다.",
    },
    {
        idx:"4",
        subTit:"완벽하게 믹싱 가능한 보조제 호환성",
        subTxt:"sh 유화는 다양한 제품과의 혼합 사용을 위한 높은 호환성을 고려해 개발되었습니다. 상위 제품인 신한 전문가 유화와 혼합 사용 시 이질감이 없으며 테레핀, 페트롤, 린시드 오일, 뽀삐유, 해바라기유와 같은 유화 보조제와 완벽한 호환성을 갖추고 있습니다.",
    },
  ];

//2. 코리안컬러
// 2-1. 신한 전문가 한국화
const korShinhan = [
        {
        idx:"1",
        subTit:"전통 회화, 패러다임의 변화",
        subTxt:"신한화구는 제조와 사용이 복잡한 전통 회화 컬러를 일반적인 튜브 형태로 제조합니다. 한국화 작가들이 더 간편하고 편리하게 사용할 수 있도록 1977년 신한 전문가 한국화을 선보였습니다. 고급 안료를 선별 사용했으며 서양의 컬러 감성과 그 결을 달리하는 진정한 대한민국 특유의 정서를 구현 하기 위해 노력했습니다. 신한 전문가 한국화의 등장으로 전통 회화의 패러다임 변화를 주도했습니다. 잊혀지고 있는 한국화의 명맥을 이어나가는데 한 역활을 담당하고 있다는 것에 큰 의미가 있습니다.",
    },
        {
        idx:"2",
        subTit:"대한민국의 정서를 담은 총 50색",
        subTxt:"한국화는 대한민국 전통 회화입니다. 일반적인 서양화와 기법, 표현에서 그 결을 달리하며 화려함 보다는 소박하고 선과 여백을 중시하며 정신적인 측면을 강조합니다. 신한 전문가 한국화의 총 50가지 색상은 관련 분야의 숙련자에 의해 세심하게 조율된 아교를 사용했습니다. 전통적인 방법으로 제조된 색상과 큰 차이가 없으며 맑고 엷으며, 부드럽게 채색되는 특유의 한국적인 감성을 담아 내었습니다.",
    },
        {
        idx:"3",
        subTit:"전통 종이 한지에 이상적인 조율",
        subTxt:"신한 전문가 한국화는 번짐과 퍼짐에 의한 윤곽으로 엷게 채색하여 그리는 수묵 담채화와 처음부터 끝까지 채색 위주로 엷게 그려나가는 진채화에 특화되어 있습니다. 또한 일반적인 화지가 아닌 대한민국 전통 종이 한지에 이상적으로 표현되도록 개발된 진정한 한국화 물감입니다.",
    },
        {
        idx:"4",
        subTit:"높은 컬러 접착력과 변색 최소화",
        subTxt:"신한 전문가 한국화는 닥나무를 주원료로 제조되는 전통 종이인 한지 표면에서 높은 접착력을 발휘합니다. 안료와 결합되는 미디엄인 아교의 제조 과정에서 신한화구만의 노하우로부터 얻을 수 있는 효과입니다. 두께가 얇은 한지에 엷게 채색하는 기법이 특징인 한국화는 색이 변형되거나 퇴화하는 변색의 가능성이 높지만 내광성이 높은 유기안료와 무기안료의 균형적인 배합과 데이터에 의한 정밀 공정으로 변색을 최소화했습니다.",
    },
  ];
// 2-2. sh 한국화
const korSH = [
    {
        idx:"1",
        subTit:"쉿! 실력 향상의 비밀 sh 한국화",
        subTxt:"sh 한국화는 신한화구의 준전문가 브랜드인 sh의 라인업으로 높은 제조 기술을 기반으로 합니다. 한국화 특유의 감성을 그대로 구현하며 고급 품질을 갖추고 있어 비기너와 준전문가 모두에게 합리적인 제품입니다. 더 스타일리쉬한 패키지 디자인으로 남들과는 다른 자신만의 라이프 스타일을 중시하는 비기너와 실력 향상을 목표로 하는 준전문가들에게 최적의 한국화 물감입니다.",
    },
    {
        idx:"2",
        subTit:"높은 제조 기술 기반의 총 13색",
        subTxt:"선별된 안료와 정밀하게 혼합된 아교는 전문가 등급의 제조 기술 노하우를 접목해 제조됩니다. 기본 한국화 작업에 충실한 총 13가지 색상은 수묵 담채화, 채색화 등 한국화 기법을 이상적으로 구현할 수 있습니다. 비기너와 준전문가들의 실력 향상에 큰 도움을 줄 수 있는 구성이며 전문가의 실력으로 한단계올라서는 발판이 되어 드릴 것입니다.",
    },
    {
        idx:"3",
        subTit:"한지 표면 최적화와 자유로운 농담 조절",
        subTxt:"sh 한국화의 색상들은 얇은 한지 위에 엷게 채색하는 기법에 이상적입니다. 또한 담묵, 중묵, 농묵 등 사용자의 의도에 따라 유연한 농담 조절이 가능하고 어떤 기법에도 고유의 깊고 맑은 컬러를 표현합니다.",
    },
  ];

// 데이터 공개하기