[
  {
    "idx": 1,
    "category": "패션 아이템",
    "date": "2025.01.06",
    "title": "1월에 신는 후끈한 슬리퍼",
    "article": "어그 타즈, 버켄스탁 보스턴 등의 인기 덕분일까요? 지난 몇 년간 겨울 슬리퍼가 넓혀온 영역을 보면 심상치 않은 야심이 느껴집니다. 팬데믹 이후 안팎의 경계가 흐릿해진 이유도 있지만, 그저 따뜻하고 편한 신발로 만족할 생각은 없어 보이더군요.^제니와 런던 여행을 함께한 스부(Subu)의 폴카 도트 패딩 슬리퍼, 올 초 리한나가 신고 나선 팔라스와 어그의 타스만 슬리퍼를 떠올려보세요! ‘집 앞 편의점’ 룩뿐 아니라 패션 아이템 자리까지 호시탐탐 노린다는 걸 알 수 있습니다. 애초에 겨울에 좀처럼 실현하기 힘든 ‘느긋하고 무심한’ 무드에 이만한 아이템도 없긴 했지만 말이죠."
  },
  {
    "idx": 2,
    "category": "패션 트렌드",
    "date": "2024.12.19",
    "title": "2025년, 마음속 한자리를 차지할 색 조합 5",
    "article": "2025년, 우리는 어떤 색을 입게 될까요? 올해는 대체로 클래식한 컬러가 강세를 보였습니다. 여름에는 보호 시크의 영향으로 화이트와 베이지가 유행했고, 최근에는 차분한 브라운이 트렌드 컬러로 급부상했죠. 지난 9~10월에 열린 쇼를 면밀히 살펴 당장은 물론 내년에도 쭉 참고할 만한 색 조합 다섯 가지를 선정했습니다.^쌀쌀한 날씨에 어울리는 조합부터 살펴볼까요? 보테가 베네타의 2025 봄/여름 컬렉션에는 가지각색의 오렌지 빛깔 아이템이 등장했습니다. 마티유 블라지가 오렌지 스커트의 짝으로 선택한 것은 브라운 컬러 톱이었는데요. 최근 셀럽들의 사랑을 독차지한 다크 브라운을 활용하는 센스가 돋보였습니다. 오렌지 컬러 특유의 화사함을 적당히 중화했죠. 덕분에 한겨울에도 입을 만큼 차분한 무드의 룩이 완성됐습니다. 봄이 오면 오렌지 스커트에 베이지색 아우터를 얹어봐도 좋겠군요."
  },
  {
    "idx": 3,
    "category": "Culture",
    "date": "2025.01.08",
    "title": "‘보그 살롱: 한복’ 이벤트에 초대합니다!",
    "article": "패션, 뷰티, 문화를 넘나드는 오프라인 경험의 새로운 장 ‘보그 살롱’에 여러분을 초대합니다. 두 번째 살롱의 주제는 ‘한복’입니다. <보그> 1월호의 주제 ‘Koreanity’를 오프라인으로 확장해, 가깝고도 먼 우리 옷 한복에 대해 더 알아보는 자리를 마련했습니다.^전통에 현대적 감성을 더한 패션 한복 브랜드 차이킴의 김영진 대표에게 한복의 기본과 함께 요즘 옷과 스타일링하는 법을 들어봅니다. 한복을 직접 착용해볼 수 있으며, <보그> 화보 촬영 팀이 <보그> 커버 모델처럼 사진을 찍어드립니다. ‘보그 살롱: 한복’ 이벤트에 응모하세요!"
  },
  {
    "idx": 4,
    "category": "패션 아이템",
    "date": "2024.12.16",
    "title": "2025년을 뒤흔들 팬츠 스타일 5",
    "article": "‘종잡을 수 없음!’ 2024년 패션 트렌드를 한마디로 요약하면 이렇습니다. 올해는 특히 다양한 디자인과 무드의 팬츠가 등장했는데요. 정숙한 분위기를 자아내는 수트 팬츠는 쭉 강세였고, 추억의 아이템인 코듀로이 팬츠와 슬림 진의 복귀가 이뤄졌습니다. 여름에는 하늘하늘한 팔라초 팬츠가 유행했죠. 내년에는 어떨까요? <보그>가 메가트렌드로 자리 잡을 듯싶은 팬츠 스타일 다섯 가지를 선별했습니다.^영리한 스타일링의 중요성이 점점 대두되기 때문일까요? Y2K 패션은 저물었지만, ‘팬츠 위 스커트’ 조합은 여전히 유효합니다. 실용적인 옷을 찾는 패션 피플이 늘어남에 따라 2025 봄/여름 시즌 중에는 바지와 치마를 결합한 ‘올인원’ 팬츠가 반복적으로 등장했죠. 두 아이템의 컬러를 맞추고, 핏을 고려하는 번거로운 과정을 생략한 겁니다. 보테가 베네타는 경직된 사무실에도 어울릴 법한 원 레그 팬츠를 제안했고, 에스토니아 출신 런던의 신성, 요한나 파르브(Johanna Parv)의 디자인에서는 고프코어의 정취가 짙게 느껴졌습니다."
  },
  {
    "idx": 5,
    "category": "패션 뉴스",
    "date": "2024.12.26",
    "title": "브랜드 앰배서더 게임이 어느 때보다 치열한 이유",
    "article": "2025 S/S 파리 패션 위크 마지막 날, 젠데이아의 루이 비통 쇼 참석은 그 자체로 뜨거운 화제가 됐다. 지난해 4월부터 하우스 앰배서더로 활동하는 그녀가 니콜라 제스키에르의 쇼에 참석한 횟수는 단 두 번뿐이었다. 지난해 6월 열린 퍼렐 윌리엄스의 남성복 데뷔 쇼를 제외하면 말이다. ^인터넷 세상은 젠데이아와 루이 비통의 관계에 관심이 많다. 그녀가 루이 비통이 아닌 다른 하우스의 옷을 얼마나 자주 입는지, 왜 그녀는 모든 쇼에 참석하지 않는지 등 매번 다양한 주제로 여러 의견이 오가는 걸 보면 알 수 있다. 그러니까 그녀는 해리 스타일스와 다르다. 해리 스타일스는 (적어도 지금까지 알려진 바로는) 앰배서더가 아니지만 최근 발렌티노 쇼에 참석했다. 알레산드로 미켈레의 하우스 데뷔를 응원하기 위해서였다."
  },
  {
    "idx": 6,
    "category": "리빙",
    "date": "2025.01.03",
    "title": "새해에는 새로운 마음가짐을! 옷장 정리의 9단계",
    "article": "미뤘던 운동을 시작해보겠다, 식습관을 바꾸겠다, 혹은 금주에 성공하고야 말겠다. 매년 1월 1일이 다가오면 우리는 나름대로의 각오를 다지곤 합니다. 굳었던 결심을 그해 12월 31일까지 흔들림 없이 관철해내는 사람은 극소수에 불과하지만 말이죠. ^올해는 옷장을 정리하는 것부터 시작해봅시다. 집 밖으로 나서기 전 우리 모두 옷장 앞에 서서 무얼 입을지 고민하는 과정을 거쳐야만 하니까요. 보기 좋게 정돈된 옷장은 작년보다 나은 삶을 살겠다는, 그 건강한 다짐을 상기시켜줄 겁니다. 5명의 ‘정리 정돈 전문가’에게 자문을 구해 완성한, 옷장 정리의 9단계를 소개합니다."
  },
  {
    "idx": 7,
    "category": "뷰티 화보",
    "date": "2025.01.03",
    "title": "나나, 그 유일의 빛깔",
    "article": "STREET COUTURE 환상과 몽상이 오가는 메종 발렌티노의 정체성이 나나의 마음을 사로잡았다. 완벽한 피부 표현은 ‘브이-라이터 #01 로사’와 ‘고-쿠션 글로우 퍼플 도즈 에디션’의 합작. ‘아이 투 치크 #09 뿌드르’로 눈두덩과 언더라인에 음영을 더하고 아이라인과 뷰러는 생략하되 ‘매그니피센트 마스카라 #01 블랙’으로 언더 래시를 가볍게 쓸어준다. 마무리로 로즈 브라운 립스틱 ‘스파이크 발렌티노 퍼플 도즈 에디션 #134R 쿠튀르 인 더 스트릿’을 입술과 두 뺨에 채색해 밸런스를 맞춘 것. 제품은 발렌티노 뷰티. 의상은 발렌티노(Valentino)."
  },
  {
    "idx": 8,
    "category": "워치&주얼리",
    "date": "2025.01.24",
    "title": "불가리와 김지원의 우아한 랑데부",
    "article": "베이비 페이스의 김지원이 연출한 ‘세르펜티’의 격렬함! 페어 셰이프 브릴리언트 컷 에메랄드 2개와 다이아몬드를 파베 세팅한 화이트 골드 목걸이.^“불가리 스토어에 방문할 때마다 아주 기뻤어요. 그보다 높이 뛰어오르고 그와 사랑에 빠졌답니다.” 배우 리처드 버튼과 엘리자베스 테일러의 열정적인 러브 스토리에서 빠지지 않는 불가리 주얼리. 엘리자베스 테일러는 ‘세르펜티’ 컬렉션의 매력을 누구보다 먼저 알아봤고, 즐겨 착용했다. 마키즈 셰이프 브릴리언트 컷 다이아몬드, 페어 컷 에메랄드와 다이아몬드를 파베 세팅한 귀고리와 목걸이, 반지."
  }
]
