// 도시 정보 데이터 JS - city_data.js

const myD0 = {
  인트로: {
    이미지:
      "https://img.freepik.com/premium-vector/city-illustration_23-2147514701.jpg",
    설명: "도시소개에 오신것을 환영합니다!",
  },
};

const myD1 = {
  서울: {
    이미지: `https://www.shutterstock.com/image-photo/songpagu-seoul-south-korea-september-260nw-2094838786.jpg`,
    설명: `대한민국의 수도인 서울을 지방자치단체인 특별시로 부르는 명칭이다. 한반도 중앙에 있으며, 한강을 사이에 두고 남북으로 펼쳐져 있다. 북쪽 끝은 도봉구 도봉동, 동쪽 끝은 강동구 상일동, 남쪽 끝은 서초구 원지동, 서쪽 끝은 강서구 오곡동이다. 시청은 중구 을지로1가(태평로1가 31)에 있다.`,
  },
  부산: {
    이미지: `https://imagescdn.gettyimagesbank.com/500/201901/jv11336724.jpg`,
    설명: `대한민국 제2의 도시이자, 제1의 무역항이다. 동쪽과 남쪽은 바다에 면하고, 서쪽은 김해시 장유동과 창원시 진해구, 북쪽은 양산시 물금읍과 김해시 대동면, 동쪽은 울산광역시 서생면·온양읍에 접한다. 대한민국 남동단의 관문으로 서울특별시에서 남동쪽으로 약 450km, 대한해협을 끼고 일본 시모노세키[下關]와 약 250km 떨어져 있다. 1군 15구로 이루어져 있으며, 면적은 765.94㎢이다. 시청 소재지는 부산광역시 연제구 연산5동 1000번지이다.`,
  },
  제주: {
    이미지: `https://www.jejusori.net/news/photo/202211/409902_416608_4312.jpg`,
    설명: `한국·중국·일본 등 극동 지역의 중앙부에 있어 지정학적으로도 중요하며, 도 전체가 바다로 둘러싸였다. 수리적(數理的)으로는 동경 126°08'∼126°58', 북위 33°06'∼34°00'에 위치한다. 북단은 북위 34°00'의 제주시 추자면 대서리이며, 남단은 북위 33°06'의 서귀포시 대정읍 마라도다. 한국 최남단에 있는 도로서, 제주도를 포함해 9개의 유인도와 55개의 무인도로 이루어졌다. 이 가운데 유인도는 우도·상추자도·하추자도·비양도·횡간도·추포도·가파도·마라도이다. 남북 간의 거리가 약 31㎞, 동서간의 거리가 약 73㎞로 동서로 가로놓인 모양이다. 러시아·중국 등의 대륙과 일본·동남아 등지를 연결하는 요충지이며, 천혜의 자연경관이 수려한 세계적인 휴양관광지다.`,
  },
};

const myD2 = {
  대전: {
    이미지: `https://i.pinimg.com/originals/3f/75/8c/3f758c4e8822c15f318e0ff79ddf6fc8.jpg`,
    설명: `동경 127°14'~127°33', 북위 36°10'~36°29'에 있다. 동쪽으로 충청북도 보은군·옥천군, 북쪽으로 충청북도 청주시, 세종특별자치시, 남쪽으로 충청남도 금산군, 서쪽으로 충청남도 논산시·공주시에 접한다.`,
  },
  대구: {
    이미지: `https://file.mk.co.kr/neds/20220225/20220225_4956350_1645675922.jpg`,
    설명: `북쪽으로 경상북도 칠곡군·군위군, 동쪽으로 경상북도 경산시·청도군, 남쪽으로 경상남도 창녕군, 서쪽으로 경상북도 고령군·성주군과 접한다. 영남지방의 중앙에서 서쪽으로 치우친 대구분지의 중앙부, 낙동강(洛東江)과 금호강(琴湖江)의 합류지점 동쪽 금호강 연안에 있다.`,
  },
  광주: {
    이미지: `https://tour.gwangju.go.kr/uploads/board/2017/02/201702111107061840.jpg`,
    설명: `북동쪽으로 담양군, 북쪽으로 장성군, 서쪽으로 함평군, 남쪽으로 나주시, 남동쪽으로 화순군에 접한다. 서울·부산·대구·인천·대전에 이어 국내 제6위를 차지하는 대도시이며, 호남지방 최대의 도시이다. 2011년 현재 행정구분은 5개 자치구, 93개 행정동으로 이루어져 있으며, 시청 소재지는 광주시 서구 내방로 111이다.`,
  },
};

export { myD0, myD1, myD2 };
