const articleInfo = [
  {
    idx: "arti-1",
    tit: [
      "복싱에 빠진 모델 수주의 이야기",
      "누구든 경기에서 한 번은 패할 수 있어. 하지만 그걸 이겨내야만 진정한 챔피언이 될 수 있지!",
    ],
    cont: [
      "나이지리아 라고스에서 나고 자랐지만, 학업은 미국에서 마쳤다. 복싱을 하는 이유는 단지 좋기 때문이다. 물론 건강을 유지하고 체력 단련도 가능할 뿐 아니라 정신적으로도 크게 긍정적으로 작용하는 운동이다. 바로 이 점이 매우 좋다. 복싱을 시작한 지는 4년째다. 프로 선수처럼 경기를 하진 않지만 언젠가 제대로 경기를 치르고 싶다. 곧 성사되기를 바란다! 복싱을 통해 경험했던 가장 스릴 넘친 순간은 친구이자 프로 복싱 선수인 모세 존슨(Moses Johnson)과 스파링했을 때다. 내가 그에게는 굉장히 쉬운 상대였지만, 나에겐 더할 나위 없이 도전적인 상황이라는 사실이 두렵게 느껴질 정도였다. 그 일을 계기로 나는 복싱이라는 스포츠를 더 높이 평가하게 됐다. 좀 더 수월하게 보이도록 만들기 위해 스스로를 밀어붙이는 복서들 역시 존경스럽다.",
      "필리핀 루세나에서 태어나 열여섯 살 때부터 복싱을 해왔다. 그렇게 27년간 복싱과 관계를 이어가고 있다. 어린 시절엔 자신감이 부족했다. 그렇지만 복싱을 통해 내 앞의 누군가와 싸울 때 모든 것이 자신에게 달려 있다는 사실을 배웠다. 누구도 나 자신을 구해주지 않기 때문이다. 내가 걷어차이거나 상대를 걷어차는 식이다. 상투적인 이야기처럼 들리겠지만, 인생이 힘들어질 때 복싱은 다시 일어나 한 번 더 시도하도록 나를 가르쳤다. 한판 더 해보는 거다! 이렇듯 복싱은 내가 더 괜찮은 사람이 되도록 도왔다. 이제 복싱을 통해 배운 교훈을 다른 사람들에게 가르치고 가능한 한 많은 사람을 돕는 게 내 목표다.",
      "멕시코시티에서 열세 살에 복싱을 시작했다. 학교와 길거리에서 수차례 싸움에 휘말리자 엄마가 나를 복싱 체육관에 보낸 것이다. 가장 기억에 남는 복싱 경험은 매디슨 스퀘어 가든에서 벌인 경기다. 그때 골든 글러브 챔피언십에서 세 번째 우승 트로피를 거머쥐었다. 지금은 프로 복싱 선수로 활동하고 있다.",
    ],
  },
  {
    idx: "arti-2",
    tit: [
      "안현모, 홍지민, 강주은 써마지 더 리얼 인터뷰",
      "써마지 더 리얼 캠페인과 함께 안현모, 홍지민, 강주은이 전하는 진정한 내 모습과 아름다움에 대한 솔직한 이야기를 확인해보세요.",
    ],
    cont: [
      "얼굴에 지나친 욕심이 나타날 때가 있잖아요. 전 나중에 제 자신이 좀 편안해 보였으면 좋겠어요.",
      "내면의 아름다움, 그리고 외면의 아름다움 두 가지 밸런스를 어떻게 잘 맞추느냐가 중요하다고 생각해요.",
      "50살이 됐다는 건 쇼킹한 순간이었어요. (하지만) 스트레스를 받거나 자신감이 떨어지고 싶지 않아요.",
    ],
  },
];
