// DKB PJ GNB메뉴 데이터 ////

export default {
  "About tvN": "없음",
  편성표: "없음",
  채널번호: "없음",
  드라마: [
    "[예정] 선재 업고 튀어",
    "[종영] 내 남편과 결혼해줘",
    "[월/화] 웨딩 임파서블",
    "[토/일] 눈물의 여왕",
    "[종영] 세작, 매혹된 자들",
  ],
  연예오락: [
    "[월] 줄 서는 식당2",
    "[금] 아파트404",
    "[일] 텐트 밖은 유럽 남프랑스 편",
    "[화] 벌거벗은 세계사",
    "[금] 프리한 닥터",
    "[종영] 나나투어 with 세븐틴",
    "[수] 유 퀴즈 온 더 블럭",
    "[토] 웰컴투불로촌",
    "[목] 70억의 선택",
    "[토] 놀라운 토요일",
  ],
  인사이트: [
    "[목] 김창옥쇼2",
    "[종영] 희망의 빛, 블루라이팅",
  ],
  동영상: "없음",
  이벤트: "없음",
  프로그램: "없음",
};
